#+title: Data structure: Linked List
#+date: 2025-05-27
#+layout: post
#+math: true
#+options: _:nil ^:nil
#+categories: ctf
* Detour: 给我一块内存空间: =malloc=, =free=
一个简单的复习: 当我们使用 =malloc= 的时候, 我们会向系统要一个一定大小的内存空间.
比如说, 如果我们要申请一个大小是 =64= 个 =float= 的空间, 那么我们会使用:

#+name: malloc-example
#+begin_src C
  float* farr_64 = malloc(sizeof(float) * 64);
#+end_src

而当我们结束了这块内存空间的使用时, 又可以通过 =free= 的方式释放这块内存空间:

#+name: free-example
#+begin_src C
  free(farr_64);
#+end_src

如此这般申请得到的内存空间是一块连续的内存空间, 我们可以用:

#+name: contiguous-data-space
#+begin_src C
  for (size_t i = 0; i < 64; i++)
    ,*(farr_64 + i)                     // 指针的形式
      = a_simple_function(farr_64[i]); // 类似数组的形式
#+end_src

来读写这个内存空间上的数据.

#+begin_html
<details><summary>示例代码</summary>
#+end_html

#+name: malloc-free-code-example
#+header: :results verbatim
#+begin_src C :exports both
  #include <stdlib.h>
  #include <stdio.h>

  #define SIZE 5

  int
  main (int argc, char** argv)
  {
    float *arr = malloc(sizeof(float) * SIZE);

    // init arr with random number [0, 1)
    for (size_t i = 0; i < SIZE; i++)
      arr[i] = ((float)rand() / (float)RAND_MAX);

    for (size_t i = 0; i < SIZE; i++)
      printf("%.2f, ", *(arr + i));

    printf("\n");

    free(arr);

    return 0;
  }
#+end_src

#+RESULTS: malloc-free-code-example
: 0.00, 0.13, 0.76, 0.46, 0.53,

#+begin_html
</details>
#+end_html

*问题*: 你现在需要储存一个用户的名字的数据,
你认为正常人类的名字应该可以在 =80= 个字符内搞定,
所以你 =malloc(80 * sizeof(char))= 作为了用户的名字的空间,
然后你得到了这样的名字:

#+begin_quote
寿限无寿限无扔屎机前天小新的内裤新八的人生巴尔蒙克·费扎利昂艾萨克·修奈达
三分之一纯情的感情的剩下三分之二是在意肉刺的感情我知道无法逃离的背叛其实
可以逃离离家出游鱿鱼煎鲣鱼鱼子自家粪池鲣鱼……这条鲣鱼跟刚才的不同这条
是池乃鲣鱼啦辣油雄帝宫王木村皇呸呸呸呸呸呸呸呸呸呸呸呸小屎丸
#+end_quote

emmm... 好吧, 那么把 =SIZE= 设为 =256= 吧, 这下足够大了吧:

#+begin_quote
Adolph Blaine Charles David Earl Frederick Gerald Hubert Irvin John Kenneth
Lloyd Martin Nero Oliver Paul Quincy Randolph Sherman Thomas Uncas Victor
William Xerxes Yancy Zeus Wolfeschlegel­steinhausen­bergerdorff­welche­
vor­altern­waren­gewissenhaft­schafers­wessen­schafe­waren­wohl­
gepflege­und­sorgfaltigkeit­beschutzen­vor­angreifen­durch­ihr­
raubgierig­feinde­welche­vor­altern­zwolfhundert­tausend­jahres­
voran­die­erscheinen­von­der­erste­erdemensch­der­raumschiff­
genacht­mit­tungstein­und­sieben­iridium­elektrisch­motors­gebrauch­
licht­als­sein­ursprung­von­kraft­gestart­sein­lange­fahrt­
hinzwischen­sternartig­raum­auf­der­suchen­nachbarschaft­der­stern­
welche­gehabt­bewohnbar­planeten­kreise­drehen­sich­und­wohin­der­
neue­rasse­von­verstandig­menschlichkeit­konnte­fortpflanzen­und­sich­
erfreuen­an­lebenslanglich­freude­und­ruhe­mit­nicht­ein­furcht­vor­
angreifen­vor­anderer­intelligent­geschopfs­von­hinzwischen­sternartig­
raum Sr.

([[https://zh.wikipedia.org/zh-cn/休伯特·布萊因·沃爾夫什里格爾斯坦霍森伯格多夫][Wikipedia-休伯特·布莱因·沃尔夫什里格尔斯坦霍森伯格多夫]])
#+end_quote

emmm... 那么把 =SIZE= 设为 =1028= 吧...

好像也不太对劲, 当然, 你也不是不能强制用户将自己的名字设定为 =3-20= 个字符,
但如果我们想要一个能够支持储存任意长度的输入的数据结构, 这该如何呢?

#+begin_html
<details><summary>也不是不能... </summary>
#+end_html

我们可以做一个数组 =append= 的操作:
1. 若需要填充的数据大小 =< length(arr)=, 则将数据写入 =arr[fill-pointer]=
2. 防止, 新建一个数组, 其大小为 =length(arr) + APPEND_SIZE=,
   然后将旧数组的所有数据都拷贝进去.

#+name: AppendableArray
#+begin_src C :exports both :results verbatim
  #include <stdio.h>
  #include <stdlib.h>

  #define DATA_T int

  typedef struct appendable_vector_ {
    size_t fill_pointer;
    size_t length;

    DATA_T* data;
  } AppendableVector;

  /*
    Return a pointer to allocated `AppendableVector`.
    If failed to alloc, return NULL;

    Parameters:
    + `length`: size of `AppendableVector`

   ,*/
  AppendableVector *make_vector(size_t length) {
    AppendableVector *vec = malloc(sizeof(AppendableVector));
    vec->data             = malloc(sizeof(DATA_T) * length);
    vec->fill_pointer     = 0;
    vec->length           = length;

    if (vec == NULL || vec->data == NULL) {
      free(vec->data);
      free(vec);
      return NULL;
    }

    return vec;
  }


  /*
    Push `element` to the end of `vec`.

    Parameters:
    + `vec`: a pointer to `AppendableVector`
    + `element`: an element as `vec` new element
   ,*/
  AppendableVector *vector_push(AppendableVector *vec, int element) {
    // no space to fill
    if (vec->fill_pointer == vec->length) {
      int *data = malloc(sizeof(DATA_T) * (vec->length + (vec->length / 2) + 1));

      for (size_t i = 0; i < vec->length; i++)
        data[i] = vec->data[i];

      free(vec->data);
      vec->data = data;
    }

    vec->data[vec->fill_pointer] = element;
    vec->fill_pointer++;

    return vec;
  }

  /*
    Free allocation of AppendableVector `vec`.
   ,*/
  void free_vector(AppendableVector *vec) {
    free(vec->data);
    free(vec);
  }

  /*
    Print all the data in AppendableVector `vec`.
   ,*/
  void print_vector(AppendableVector *vec) {
    printf("[");
    for (size_t i = 0; i < vec->fill_pointer; i++)
      printf("%d, ", vec->data[i]);
    printf("]\n");
  }

  int main(int argc, char **argv) {
    AppendableVector *vec = make_vector(0);

    for (int i = 0; i < 10; i++) {
      print_vector(vector_push(vec, i));
    }

    free_vector(vec);
    return 0;
  }
#+end_src

#+RESULTS: AppendableArray
#+begin_example
[0, ]
[0, 1, ]
[0, 1, 2, ]
[0, 1, 2, 3, ]
[0, 1, 2, 3, 4, ]
[0, 1, 2, 3, 4, 5, ]
[0, 1, 2, 3, 4, 5, 6, ]
[0, 1, 2, 3, 4, 5, 6, 7, ]
[0, 1, 2, 3, 4, 5, 6, 7, 8, ]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, ]
#+end_example

#+begin_html
</details>
#+end_html

